In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\gram\miniconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\gram\miniconda3\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\gram\miniconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\gram\miniconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\gram\miniconda3\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\gram\miniconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd

In [6]:
# S03-02
# 데이터프레임 만들기
s_data = {'name': ['winter', 'isa', 'liz',
'lily', 'daniel' ],
'class': ['senior', 'senior', 'junior',
'senior', 'junior' ],
'math_sc': [90, 95, 85, 70, 75] }
stu = pd.DataFrame(data = s_data)
print (stu)

     name   class  math_sc
0  winter  senior       90
1     isa  senior       95
2     liz  junior       85
3    lily  senior       70
4  daniel  junior       75

In [9]:
# Exercise 03-01
s_cafe = {'menu' : ['Americano', 'Cafe Latte', 'Iced Tea', 'Mint Latte'],
        'type' : ['coffee','coffee','non coffee', 'non coffee'],
        'price' : [2100, 2800, 2300, 3000]}
cafe = pd.DataFrame(data = s_cafe)
print(cafe)

         menu        type  price
0   Americano      coffee   2100
1  Cafe Latte      coffee   2800
2    Iced Tea  non coffee   2300
3  Mint Latte  non coffee   3000

In [11]:
print(stu.iloc[0, 1])
print()

print(stu.iloc[2:])
print()

stu.iloc[3, 2] = 100
print(stu)

senior

     name   class  math_sc
2     liz  junior       85
3    lily  senior       70
4  daniel  junior       75

     name   class  math_sc
0  winter  senior       90
1     isa  senior       95
2     liz  junior       85
3    lily  senior      100
4  daniel  junior       75

In [12]:
print(stu.loc[0, 'name'])
print()

print(stu.loc[2, ['name', 'math_sc']])
print()

stu.loc[3, 'math_sc'] = 70
print(stu)

winter

name       liz
math_sc     85
Name: 2, dtype: object

     name   class  math_sc
0  winter  senior       90
1     isa  senior       95
2     liz  junior       85
3    lily  senior       70
4  daniel  junior       75

In [13]:
stu['eng_sc'] = [80, 90, 90, 95, 80]
print(stu)

     name   class  math_sc  eng_sc
0  winter  senior       90      80
1     isa  senior       95      90
2     liz  junior       85      90
3    lily  senior       70      95
4  daniel  junior       75      80

In [18]:
# Exercise 03-03

print(cafe.iloc[:])
print()
print(cafe.loc[2])
print()
print(cafe.loc[1, 'price'])

         menu        type  price
0   Americano      coffee   2100
1  Cafe Latte      coffee   2800
2    Iced Tea  non coffee   2300
3  Mint Latte  non coffee   3000

menu       Iced Tea
type     non coffee
price          2300
Name: 2, dtype: object

2800

In [25]:
# Exercise 03-04

price3 = cafe.loc[2, 'price']
cafe.loc[2, 'price'] = price3 + 200
print(cafe)

         menu        type  price
0   Americano      coffee   2100
1  Cafe Latte      coffee   2800
2    Iced Tea  non coffee   2500
3  Mint Latte  non coffee   3000

In [26]:
# S03-08
# math_sc를 2로 나누기
print (stu['math_sc'] / 2 )
print ()
# 수학 점수와 영어 점수의 평균 열 만들기
stu['avg_sc' ] = (stu['math_sc' ] + stu['eng_sc' ] ) / 2
# 수정 확인
print (stu)

0    45.0
1    47.5
2    42.5
3    35.0
4    37.5
Name: math_sc, dtype: float64

     name   class  math_sc  eng_sc  avg_sc
0  winter  senior       90      80    85.0
1     isa  senior       95      90    92.5
2     liz  junior       85      90    87.5
3    lily  senior       70      95    82.5
4  daniel  junior       75      80    77.5

In [27]:
# S03-09
# avg_sc가 85 이상인지 여부
print (stu['avg_sc'] >= 85 )
print ()
# 수학 점수가 영어 점수보다 높은지 여부를 담은
# mt_ov_eg 열 만들기
stu['mt_ov_eg'] = stu['math_sc' ] > stu['eng_sc' ]
# 수정 확인
print (stu)

0     True
1     True
2     True
3    False
4    False
Name: avg_sc, dtype: bool

     name   class  math_sc  eng_sc  avg_sc  mt_ov_eg
0  winter  senior       90      80    85.0      True
1     isa  senior       95      90    92.5      True
2     liz  junior       85      90    87.5     False
3    lily  senior       70      95    82.5     False
4  daniel  junior       75      80    77.5     False

In [28]:
# S03-10
# 수학과 영어 점수가 모두 85 이상인지 여부
(stu['math_sc' ] >= 85) & (stu['eng_sc' ] >= 85)

0    False
1     True
2     True
3    False
4    False
dtype: bool

In [29]:
# S03-11
# 점수 평균이 85 이상인 행만 선택
stu[ stu['avg_sc'] >= 85 ]

     name   class  math_sc  eng_sc  avg_sc  mt_ov_eg
0  winter  senior       90      80    85.0      True
1     isa  senior       95      90    92.5      True
2     liz  junior       85      90    87.5     False

In [30]:
# S03-12
# 점수 평균이 85 이상인 학생 수 구하기
stu[ stu['avg_sc'] >= 85 ].shape [0]

3

In [34]:
# Exercise 03-05
cafe['volume'] = [300, 200, 250, 180]
print(cafe)
cafe['revenue'] = cafe['price'] * cafe['volume']
print(cafe)

         menu        type  price  volume
0   Americano      coffee   2100     300
1  Cafe Latte      coffee   2800     200
2    Iced Tea  non coffee   2500     250
3  Mint Latte  non coffee   3000     180
         menu        type  price  volume  revenue
0   Americano      coffee   2100     300   630000
1  Cafe Latte      coffee   2800     200   560000
2    Iced Tea  non coffee   2500     250   625000
3  Mint Latte  non coffee   3000     180   540000

In [38]:
# Exercise 03-06
print(sum(cafe['revenue']))

print(cafe[cafe['revenue'] >= 600000].shape[0])

2355000
2

In [2]:
import pandas as pd
# S03-13
ping = pd.read_csv('사랑의하츄핑_영화관별.csv',encoding = 'utf-8')
ping.head( ) # DF.head( )는 첫 5행

           날짜    영화관  스크린수  상영횟수
0  2024-08-07    CGV   495  1135
1  2024-08-07  롯데시네마   318   899
2  2024-08-07   메가박스   182   517
3  2024-08-08    CGV   459  1130
4  2024-08-08  롯데시네마   318   863

In [8]:
# S03-14
# 첫 5행을 CSV 파일로 내보내기
ping_f5 = ping.head( )
# index = False를 해주어야 행이름 없이 저장돼요.
ping_f5.to_csv('사랑의하츄핑_5행.csv', index = False, encoding = 'utf-8-sig' )

In [9]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\gram\miniconda3\lib\site-packages (2.1.1)

In [11]:
# S03-15
# 스크린 당 상영횟수 구하기
ping ['평균상영' ] = ping ['상영횟수' ] / ping ['스크린수' ]
# numpy 불러오기
import numpy as np
# 평균상영이 3 이상인지 확인하는 열 만들기
ping ['수준'] = np.where(ping['평균상영'] >= 2.5,
'좋음', '아쉽')
# 확인
ping.head( )

           날짜    영화관  스크린수  상영횟수      평균상영  수준
0  2024-08-07    CGV   495  1135  2.292929  아쉽
1  2024-08-07  롯데시네마   318   899  2.827044  좋음
2  2024-08-07   메가박스   182   517  2.840659  좋음
3  2024-08-08    CGV   459  1130  2.461874  아쉽
4  2024-08-08  롯데시네마   318   863  2.713836  좋음